_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_5 (Bidirection (None, 300, 256)          134144    
_________________________________________________________________
bidirectional_6 (Bidirection (None, 256)               395264    
_________________________________________________________________
dense_7 (Dense)              (None, 64)                16448     
_________________________________________________________________
dense_8 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_9 (Dense)              (None, 2)                 66        
=================================================================
Total params: 548,002
Trainable params: 548,002
Non-trainable params: 0
_________________________________________________________________